system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-0.0028432 -9.91e-5 -1.0e-4)
	(0.038203 -9.91e-5 -1.0e-4)
	(0.038203 0.019919 -1.0e-4)
	(-0.0028432 0.019919 -1.0e-4)
	(-0.0028432 -9.91e-5 0.0205)
	(0.038203 -9.91e-5 0.0205)
	(0.038203 0.019919 0.0205)
	(-0.0028432 0.019919 0.0205)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (41 20 20) simpleGrading (1.0 1.0 1.0)
);
edges	();
boundary	(
	boundaries
	{
		type	patch;
		faces	(
			(0 4 7 3)
			(2 6 5 1)
			(1 5 4 0)
			(3 7 6 2)
			(0 3 2 1)
			(4 5 6 7)
		);
	}
);
