constant/transportProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	transportProperties;
}
phases	(HDPE air);
HDPE
{
	rho	952.0;
	transportModel	powerLaw;
	powerLawCoeffs
	{
		nuMax	nuMax [0 2 -1 0 0 0 0] 1000.0;
		k	k [0 2 -1 0 0 0 0] 21.0084;
		n	n [0 0 0 0 0 0 0] 0.41;
		nuMin	nuMin [0 2 -1 0 0 0 0] 0.006;
	}
}
air
{
	rho	1.21;
	transportModel	Newtonian;
	nu	nu [0 2 -1 0 0 0 0] 1.51E-5;
}
sigma	sigma [1 0 -2 0 0 0 0] 0.026;
