0/p_rgh
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	p_rgh;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 0.0;
boundaryField
{
	housing_inlet
	{
		type	uniformFixedValue;
		uniformValue	table (
	(0.0 1600000.0)
	(0.5 3.0E7)
	(1.0 5.0E7)
	(1.5 3.0E7)
);
	}
	housing_outlet1
	{
		type	totalPressure;
		p0	uniform 100000.0;
		rho	rho;
		phi	rhoPhi;
		gamma	0;
	}
	housing_outlet1_tube_wall
	{
		type	fixedFluxPressure;
	}
	housing_outlet2
	{
		type	totalPressure;
		p0	uniform 100000.0;
		rho	rho;
		phi	rhoPhi;
		gamma	0;
	}
	housing_outlet2_tube_wall
	{
		type	fixedFluxPressure;
	}
	housing
	{
		type	fixedFluxPressure;
	}
}
