system/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	fvOptions;
}
velocityLimit
{
	active	true;
	type	limitVelocity;
	limitVelocityCoeffs
	{
		max	10.0;
		selectionMode	all;
		U	U;
	}
}
