system/setFieldsDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	setFieldsDict;
}
defaultFieldValues	();
regions	(
	boxToCell
	{
		box	(0.012 0.005 0.006) (0.022 0.015 0.026);
		fieldValues	(
			volScalarFieldValue	alpha.HDPE 1.0
		);
	}
);
